automation/performance/artillery-load-test.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:8080' }}"
  phases:
    - duration: 60
      arrivalRate: 100
      name: "Baseline Load Test (100 VUs / 1 min)"
    - duration: 120
      arrivalRate: 200
      rampTo: 1000
      name: "Ramping Stress Test"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Health check & Authentication baseline load flow"
    flow:
      - get:
          url: "/api/v1/health"
      - post:
          url: "/api/v1/auth/login"
          json:
            email: "testuser@canineai.com"
            password: "TestPassword123!"